# 100 pandas excercises
- combine https://github.com/ajcr/100-pandas-puzzles and https://www.kaggle.com/code/npscul/learn-pandas-100-exercises

In [1]:
import pandas as pd
import numpy as np

#### 1. Add a prefix or suffix to all columns

In [2]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data=data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [3]:
pre_df = df.add_prefix("x_")
pre_df

  x_animal  x_age  x_visits x_priority
a      cat    2.5         1        yes
b      cat    3.0         3        yes
c    snake    0.5         2         no
d      dog    NaN         3        yes
e      dog    5.0         2         no
f      cat    2.0         3         no
g    snake    4.5         1         no
h      cat    NaN         1        yes
i      dog    7.0         2         no
j      dog    3.0         1         no

In [4]:
suf_df = df.add_suffix("_123")
suf_df

  animal_123  age_123  visits_123 priority_123
a        cat      2.5           1          yes
b        cat      3.0           3          yes
c      snake      0.5           2           no
d        dog      NaN           3          yes
e        dog      5.0           2           no
f        cat      2.0           3           no
g      snake      4.5           1           no
h        cat      NaN           1          yes
i        dog      7.0           2           no
j        dog      3.0           1           no

#### 2. Reverse order of a dataframe (assume that is is fro all columns)

In [5]:
df[::-1]

  animal  age  visits priority
j    dog  3.0       1       no
i    dog  7.0       2       no
h    cat  NaN       1      yes
g  snake  4.5       1       no
f    cat  2.0       3       no
e    dog  5.0       2       no
d    dog  NaN       3      yes
c  snake  0.5       2       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes

#### 3. Filter a df by multiple conditions (isin and inverse using ~)
- (isin for Series)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [7]:
df[(df["animal"].isin(["cat"])) & (~(df["age"] > 7))] # search for cats and age less than 7

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
h    cat  NaN       1      yes

#### 4. Create a DataFrame df from this dictionary data which has the index labels:
```python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```

In [8]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data=data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 5. Display a summary of the basic information about this DataFrame and its data (hint: there is a single method that can be called on the DataFrame).

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

#### 6. Return the first 3 rows of the DataFrame df.

In [10]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

#### 7. Select just the 'animal' and 'age' columns from the DataFrame df.

In [11]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

#### 8. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [12]:
df[['animal', 'age']].iloc[[3, 4, 8]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

#### 9. Select only the rows where the number of visits is greater than 3.

In [13]:
df[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 10. Select the rows where the age is missing, i.e. it is NaN.

In [14]:
df[df["age"].isnull()] # could use isnull on a Series

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [15]:
df[df['age'].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

#### 11. Select the rows where the animal is a cat and the age is less than 3.

In [16]:
df[(df["animal"] == "cat") & (df["age"] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

#### 12. Select the rows the age is between 2 and 4 (inclusive).

In [17]:
df[(df["age"] >= 2) & (df["age"] <= 4)] # could use between
# df[df["age"].between(2, 4, inclusive='both')]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

#### 13. Change the age in row 'f' to 1.5.

In [18]:
df.loc["f", "age"] = 1.5
df["age"]

a    2.5
b    3.0
c    0.5
d    NaN
e    5.0
f    1.5
g    4.5
h    NaN
i    7.0
j    3.0
Name: age, dtype: float64

#### 14. Calculate the sum of all visits in df (i.e. find the total number of visits).

In [19]:
df["visits"].sum()

np.int64(19)

#### 15. Calculate the mean age for each different animal in df.

In [20]:
df.groupby("animal")["age"].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

#### 16. Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.

In [21]:
df.loc[len(df)] = "k"
df

   animal  age visits priority
a     cat  2.5      1      yes
b     cat  3.0      3      yes
c   snake  0.5      2       no
d     dog  NaN      3      yes
e     dog  5.0      2       no
f     cat  1.5      3       no
g   snake  4.5      1       no
h     cat  NaN      1      yes
i     dog  7.0      2       no
j     dog  3.0      1       no
10      k    k      k        k

In [ ]:
df = df.drop(df.index[len(df) - 1]) # could also pass in the arugment inplace=True without reasignment
df

  animal  age visits priority
a    cat  2.5      1      yes
b    cat  3.0      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog  5.0      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog  7.0      2       no
j    dog  3.0      1       no

#### 17. Count the number of each type of animal in df.

In [ ]:
df["animal"].value_counts()
# df.groupby("animal").size() also works, but value_counts is more direct
# df.groupby("animal")["animal"].count()

animal
cat      4
dog      4
snake    2
Name: count, dtype: int64

In [44]:
df.groupby("animal").count() # or df["animal"].value_counts()

        age  visits  priority
animal
cat       3       4         4
dog       3       4         4
snake     2       2         2

#### 18. Sort df first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order (so row i should be first, and row d should be last).

In [24]:
df.sort_values(by=["age", "visits"], ascending=[False, True])

  animal  age visits priority
i    dog  7.0      2       no
e    dog  5.0      2       no
g  snake  4.5      1       no
j    dog  3.0      1       no
b    cat  3.0      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

#### 19. The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

In [ ]:
df["priority"] = df["priority"].map({"yes": True, "no": False}) 
df # could also use replace, but map is the recommended approach because of downcasting

  animal  age visits  priority
a    cat  2.5      1      True
b    cat  3.0      3      True
c  snake  0.5      2     False
d    dog  NaN      3      True
e    dog  5.0      2     False
f    cat  1.5      3     False
g  snake  4.5      1     False
h    cat  NaN      1      True
i    dog  7.0      2     False
j    dog  3.0      1     False

#### 20. In the 'animal' column, change the 'snake' entries to 'python'.

In [26]:
df["animal"] = df["animal"].replace({"snake": "python"})
df

   animal  age visits  priority
a     cat  2.5      1      True
b     cat  3.0      3      True
c  python  0.5      2     False
d     dog  NaN      3      True
e     dog  5.0      2     False
f     cat  1.5      3     False
g  python  4.5      1     False
h     cat  NaN      1      True
i     dog  7.0      2     False
j     dog  3.0      1     False

#### 21. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [27]:
df.pivot_table(values='age', index='animal', columns='visits', aggfunc='mean')

visits    1    2     3
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
python  4.5  0.5   NaN

#### 22. You have a DataFrame df with a column 'A' of integers. For example:

df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

1, 2, 3, 4, 5, 6, 7

In [28]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df[df["A"].ne(df['A'].shift())]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 23. Given a DataFrame of numeric values, say

df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
how do you subtract the row mean from each element in the row?

In [29]:
np.random.seed(42)
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.374540  0.950714  0.731994
1  0.598658  0.156019  0.155995
2  0.058084  0.866176  0.601115
3  0.708073  0.020584  0.969910
4  0.832443  0.212339  0.181825

In [30]:
df - df.mean()

          0         1         2
0 -0.139819  0.509548  0.203826
1  0.084299 -0.285148 -0.372173
2 -0.456276  0.425010  0.072947
3  0.193713 -0.420582  0.441742
4  0.318083 -0.228827 -0.346343

#### 24. Suppose you have DataFrame with 10 columns of real numbers, for example:

df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
Which column of numbers has the smallest sum? Return that column's label.

In [31]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.183405,0.304242,0.524756,0.431945,0.291229,0.611853,0.139494,0.292145,0.366362,0.456070
1,0.785176,0.199674,0.514234,0.592415,0.046450,0.607545,0.170524,0.065052,0.948886,0.965632
2,0.808397,0.304614,0.097672,0.684233,0.440152,0.122038,0.495177,0.034389,0.909320,0.258780
3,0.662522,0.311711,0.520068,0.546710,0.184854,0.969585,0.775133,0.939499,0.894827,0.597900
4,0.921874,0.088493,0.195983,0.045227,0.325330,0.388677,0.271349,0.828738,0.356753,0.280935

In [32]:
df = df.sum()

In [33]:
df.idxmin()

'b'

#### 25. How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)? As input, use a DataFrame of zeros and ones with 10 rows and 3 columns.

df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))

In [34]:
np.random.seed(42)
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
df

   0  1  2
0  0  1  0
1  0  0  1
2  0  0  0
3  1  0  0
4  0  0  1
5  0  1  1
6  1  0  1
7  0  1  1
8  1  1  1
9  1  1  1

In [35]:
len(df.drop_duplicates())

7

#### 26. In the cell below, you have a DataFrame df that consists of 10 columns of floating-point numbers. Exactly 5 entries in each row are NaN values.

For each row of the DataFrame, find the column which contains the third NaN value.

You should return a Series of column labels: e, c, d, h, d

In [36]:
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columns = list('abcdefghij')

df = pd.DataFrame(data, columns=columns)
df
# write a solution to the question here

      a   b     c     d     e     f     g     h     i     j
0  0.04 NaN   NaN  0.25   NaN  0.43  0.71  0.51   NaN   NaN
1   NaN NaN   NaN  0.04  0.76   NaN   NaN  0.67  0.76  0.16
2   NaN NaN  0.50   NaN  0.31  0.40   NaN   NaN  0.24  0.01
3  0.49 NaN   NaN  0.62  0.73  0.26  0.85   NaN   NaN   NaN
4   NaN NaN  0.41   NaN  0.05   NaN  0.61   NaN  0.48  0.68

In [37]:
(df.isnull().cumsum(axis=1) == 3).idxmax(axis=1) # need to think about this.

0    e
1    c
2    d
3    h
4    d
dtype: object

#### 27. A DataFrame has a column of groups 'grps' and and column of integer values 'vals':

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each group, find the sum of the three greatest values. You should end up with the answer as follows:
```
grps
a    409
b    156
c    345
```

In [38]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

# write a solution to the question here
df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [39]:
df.groupby("grps")["vals"].apply(lambda x: x.nlargest(3).sum()) # Gooogle Gemini version

grps
a    409
b    156
c    345
Name: vals, dtype: int64

In [40]:
df.groupby("grps")["vals"].nlargest(3).reset_index().groupby("grps")["vals"].sum()
# The nlargest returns a Series with wonky index, need to reset it then add it all up
# You can't use it directly because nlargest() on a groupby object is designed to filter the original data,
#  not to aggregate it. It returns the top n rows from each group, not a single calculated value (like a sum).

grps
a    409
b    156
c    345
Name: vals, dtype: int64

#### 28. The DataFrame `df` constructed below has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive). 

For each group of 10 consecutive integers in 'A' (i.e. `(0, 10]`, `(10, 20]`, ...), calculate the sum of the corresponding values in column 'B'.

The answer should be a Series as follows:

```
A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
```

In [41]:
df = pd.DataFrame(np.random.RandomState(8765).randint(1, 101, size=(100, 2)), columns = ["A", "B"])

# write a solution to the question here
df

     A   B
0   46  29
1   75  22
2   49  63
3   33  43
4   71  75
..  ..  ..
95  60  87
96  57  40
97  86  19
98  50  56
99  97  94

[100 rows x 2 columns]

In [42]:

df.groupby(pd.cut(df['A'], bins=np.arange(0, 101, 10)), observed=False)['B'].sum()
# pd.cut turn numeric data into category data, this can be used for groupby to select column 'B' for the sum

A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
Name: B, dtype: int32

#### 29. Consider a DataFrame `df` where there is an integer column 'X':
```python
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
```
For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be 

```
[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]
```

Make this a new column 'Y'.

In [43]:
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

In [44]:
new_s = (df["X"] != 0).astype(int) # create a mask of ones and zeros when each integer is a one and zeros are zeros
groups = (new_s == 0).cumsum() # create groups using cumsum
df["Y"] = new_s.groupby(groups).cumsum() # using those groups to count the frequency between the zeros
df

# http://stackoverflow.com/questions/30730981/how-to-count-distance-to-the-previous-zero-in-pandas-series/

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

#### 30. Consider the DataFrame constructed below which contains rows and columns of numerical data. 

Create a list of the column-row index locations of the 3 largest values in this DataFrame. In this case, the answer should be:
```
[(5, 7), (6, 4), (2, 5)]
```

In [45]:
df = pd.DataFrame(np.random.RandomState(30).randint(1, 101, size=(8, 8)))
df
# Write your answer here:

    0   1   2   3   4   5   6   7
0  38  38  46  46  13  24   3  54
1  18  47   4  42   8  66  50  46
2  62  36  19  19  77  17   7  63
3  28  47  46  65  63  12  16  24
4  14  51  34  56  29  59  92  79
5  58  76  96  45  38  76  58  40
6  10  34  48  40  37  23  41  26
7  55  70  91  27  79  92  20  31

In [46]:
stacked_series = df.stack() # combine all columns into rows (make 1 big series)
row_col_list = list(stacked_series.nlargest(3).index) # get the largest 3 indices and put it into a list
list(map(lambda t: (t[1], t[0]), row_col_list)) # change the row-col into col-row 
# Google Gemini give a better than the stackoverlow answer 
# at: http://stackoverflow.com/questions/14941261/index-and-column-for-the-max-value-in-pandas-dataframe/

[(2, 5), (6, 4), (5, 7)]

#### 31. You are given the DataFrame below with a column of group IDs, 'grps', and a column of corresponding integer values, 'vals'.

```python
df = pd.DataFrame({"vals": np.random.RandomState(31).randint(-30, 30, size=15), 
                   "grps": np.random.RandomState(31).choice(["A", "B"], 15)})
```

Create a new column 'patched_values' which contains the same values as the 'vals' any negative values in 'vals' with the group mean:

```
    vals grps  patched_vals
0    -12    A          13.6
1     -7    B          28.0
2    -14    A          13.6
3      4    A           4.0
4     -7    A          13.6
5     28    B          28.0
6     -2    A          13.6
7     -1    A          13.6
8      8    A           8.0
9     -2    B          28.0
10    28    A          28.0
11    12    A          12.0
12    16    A          16.0
13   -24    A          13.6
14   -12    A          13.6
```

In [47]:
df = pd.DataFrame({"vals": np.random.RandomState(31).randint(-30, 30, size=15), 
                   "grps": np.random.RandomState(31).choice(["A", "B"], 15)})
df

    vals grps
0    -12    A
1     -7    B
2    -14    A
3      4    A
4     -7    A
5     28    B
6     -2    A
7     -1    A
8      8    A
9     -2    B
10    28    A
11    12    A
12    16    A
13   -24    A
14   -12    A

In [48]:
def patched_values(x):
    mask =  x < 0
    x[mask] = x[~mask].mean()
    return x

df["patched_vals"] = df.groupby("grps")["vals"].transform(patched_values)
df

C:\Users\thotc\AppData\Local\Temp\ipykernel_28124\2820800049.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '13.6' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  x[mask] = x[~mask].mean()

    vals grps  patched_vals
0    -12    A          13.6
1     -7    B          28.0
2    -14    A          13.6
3      4    A           4.0
4     -7    A          13.6
5     28    B          28.0
6     -2    A          13.6
7     -1    A          13.6
8      8    A           8.0
9     -2    B          28.0
10    28    A          28.0
11    12    A          12.0
12    16    A          16.0
13   -24    A          13.6
14   -12    A          13.6

#### 32. Implement a rolling mean over groups with window size 3, which ignores NaN value. For example consider the following DataFrame:

```python
>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
>>> df
   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
```
The goal is to compute the Series:

```
0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
```
E.g. the first window of size three for group 'b' has values 3.0, NaN and 3.0 and occurs at row index 5. Instead of being NaN the value in the new column at this row index should be 3.0 (just the two non-NaN values are used to compute the mean (3+3)/2)

In [49]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [50]:
g1 = df.groupby(['group'])['value']              # group values  
g2 = df.fillna(0).groupby(['group'])['value']    # fillna, then group values

s = g2.rolling(2).sum() / g1.rolling(2).count() # the actual computation

s.reset_index(level=0, drop=True).sort_index()  # drop/sort index
# https://stackoverflow.com/questions/36988123/pandas-groupby-and-rolling-apply-ignoring-nans

0     NaN
1     1.5
2     NaN
3     3.0
4     2.0
5     3.0
6     3.0
7     1.0
8     4.5
9     2.0
10    7.0
11    5.5
Name: value, dtype: float64

#### 33. Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series s.

In [53]:
s_index = pd.date_range("20150101", "20151231", freq="B")
s = pd.Series(np.random.rand(len(s_index)), index=s_index)
s

2015-01-01    0.183405
2015-01-02    0.304242
2015-01-05    0.524756
2015-01-06    0.431945
2015-01-07    0.291229
                ...
2015-12-25    0.810113
2015-12-28    0.867072
2015-12-29    0.913241
2015-12-30    0.511342
2015-12-31    0.501516
Freq: B, Length: 261, dtype: float64

#### 34. Find the sum of the values in s for every Wednesday.

In [54]:
s[s.index.weekday == 2].sum()

np.float64(23.90437564403512)

#### 35. For each calendar month in s, find the mean of values.

In [56]:
s.resample('ME').mean()

2015-01-31    0.436823
2015-02-28    0.522747
2015-03-31    0.439629
2015-04-30    0.449735
2015-05-31    0.567011
2015-06-30    0.464192
2015-07-31    0.460407
2015-08-31    0.465205
2015-09-30    0.482111
2015-10-31    0.546376
2015-11-30    0.570482
2015-12-31    0.595195
Freq: ME, dtype: float64

#### 36. For each group of four consecutive calendar months in s, find the date on which the highest value occurred.

In [58]:
s.groupby(pd.Grouper(freq='4ME')).idxmax()

2015-01-31   2015-01-28
2015-05-31   2015-03-18
2015-09-30   2015-07-15
2016-01-31   2015-12-11
Freq: 4ME, dtype: datetime64[ns]

#### 37. Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

In [59]:
pd.date_range('2015-01-01', '2016-12-31', freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

## For questions 38-43, uses the following data:
It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```
Formatted, it looks like this:

```
            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"
```

#### 38. Some values in the the FlightNumber column are missing (they are NaN). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Modify df to fill in these missing numbers and make the column an integer column (instead of a float column).

In [60]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

#### 39. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame called 'temp' with the correct values. Assign the correct column names 'From' and 'To' to this temporary DataFrame.

In [61]:
temp = df.From_To.str.split('_', expand=True)
temp.columns = ['From', 'To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

#### 40. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame 'temp'. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [62]:
temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

#### 41. Delete the From_To column from df and attach the temporary DataFrame 'temp' from the previous questions.

In [63]:
df = df.drop('From_To', axis=1)
df = df.join(temp)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

#### 42. In the Airline column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. '(British Airways. )' should become 'British Airways'.

In [65]:
df['Airline'] = df['Airline'].str.extract('([a-zA-Z]+)', expand=False).str.strip()
# note: using .strip() gets rid of any leading/trailing spaces
df

   FlightNumber  RecentDelays  Airline      From         To
0         10045      [23, 47]      KLM    London      Paris
1         10055            []      Air    Madrid      Milan
2         10065  [24, 43, 87]  British    London  Stockholm
3         10075          [13]      Air  Budapest      Paris
4         10085      [67, 32]    Swiss  Brussels     London

#### 43. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [66]:
# there are several ways to do this, but the following approach is possibly the simplest

delays = df['RecentDelays'].apply(pd.Series)

delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]

df = df.drop('RecentDelays', axis=1).join(delays)

df

   FlightNumber  Airline      From         To  delay_1  delay_2  delay_3
0         10045      KLM    London      Paris     23.0     47.0      NaN
1         10055      Air    Madrid      Milan      NaN      NaN      NaN
2         10065  British    London  Stockholm     24.0     43.0     87.0
3         10075      Air  Budapest      Paris     13.0      NaN      NaN
4         10085    Swiss  Brussels     London     67.0     32.0      NaN

#### 44. Given the lists letters = ['A', 'B', 'C'] and numbers = list(range(10)), construct a MultiIndex object from the product of the two lists. Use it to index a Series of random numbers. Call this Series s.

In [67]:
letters = ['A', 'B', 'C']
numbers = list(range(10))

mi = pd.MultiIndex.from_product([letters, numbers])
s = pd.Series(np.random.rand(30), index=mi)
s

A  0    0.798295
   1    0.649964
   2    0.701967
   3    0.795793
   4    0.890005
   5    0.337995
   6    0.375583
   7    0.093982
   8    0.578280
   9    0.035942
B  0    0.465598
   1    0.542645
   2    0.286541
   3    0.590833
   4    0.030500
   5    0.037348
   6    0.822601
   7    0.360191
   8    0.127061
   9    0.522243
C  0    0.769994
   1    0.215821
   2    0.622890
   3    0.085347
   4    0.051682
   5    0.531355
   6    0.540635
   7    0.637430
   8    0.726091
   9    0.975852
dtype: float64

#### 45. Check the index of s is lexicographically sorted (this is a necessary property for indexing to work correctly with a MultiIndex).

In [78]:
s.index.is_monotonic_increasing

True

#### 46. Select the labels 1, 3 and 6 from the second level of the MultiIndexed Series.

In [79]:
s.loc[:, [1, 3, 6]]

A  1    0.649964
   3    0.795793
   6    0.375583
B  1    0.542645
   3    0.590833
   6    0.822601
C  1    0.215821
   3    0.085347
   6    0.540635
dtype: float64

#### 47. Slice the Series s; slice up to label 'B' for the first level and from label 5 onwards for the second level.

In [80]:
s.loc[pd.IndexSlice[:'B', 5:]]

# or equivalently without IndexSlice...
s.loc[slice(None, 'B'), slice(5, None)]

A  5    0.337995
   6    0.375583
   7    0.093982
   8    0.578280
   9    0.035942
B  5    0.037348
   6    0.822601
   7    0.360191
   8    0.127061
   9    0.522243
dtype: float64

#### 48. Sum the values in s for each label in the first level (you should have Series giving you a total for labels A, B and C).

In [86]:
s.groupby(level=0).sum()

A    5.257806
B    3.785561
C    5.157097
dtype: float64

#### 49. Suppose that sum() (and other methods) did not accept a level keyword argument. How else could you perform the equivalent of s.sum(level=1)?

In [87]:
s.unstack().sum(axis=0)

0    2.033887
1    1.408430
2    1.611399
3    1.471973
4    0.972187
5    0.906698
6    1.738819
7    1.091602
8    1.431432
9    1.534038
dtype: float64

#### 50. Exchange the levels of the MultiIndex so we have an index of the form (letters, numbers). Is this new Series properly lexsorted? If not, sort it.

In [89]:
new_s = s.swaplevel(0, 1)

if not new_s.index.is_monotonic_increasing:
    new_s = new_s.sort_index()

new_s

0  A    0.798295
   B    0.465598
   C    0.769994
1  A    0.649964
   B    0.542645
   C    0.215821
2  A    0.701967
   B    0.286541
   C    0.622890
3  A    0.795793
   B    0.590833
   C    0.085347
4  A    0.890005
   B    0.030500
   C    0.051682
5  A    0.337995
   B    0.037348
   C    0.531355
6  A    0.375583
   B    0.822601
   C    0.540635
7  A    0.093982
   B    0.360191
   C    0.637430
8  A    0.578280
   B    0.127061
   C    0.726091
9  A    0.035942
   B    0.522243
   C    0.975852
dtype: float64

#### 51. Let's suppose we're playing Minesweeper on a 5 by 4 grid, i.e.
```
X = 5
Y = 4
````
To begin, generate a DataFrame df with two columns, 'x' and 'y' containing every coordinate for this grid. That is, the DataFrame should start:
```
   x  y
0  0  0
1  0  1
2  0  2
````

In [90]:
X = 5
Y = 4

p = pd.core.reshape.util.cartesian_product([np.arange(X), np.arange(Y)])
df = pd.DataFrame(np.asarray(p).T, columns=['x', 'y'])
df

    x  y
0   0  0
1   0  1
2   0  2
3   0  3
4   1  0
5   1  1
6   1  2
7   1  3
8   2  0
9   2  1
10  2  2
11  2  3
12  3  0
13  3  1
14  3  2
15  3  3
16  4  0
17  4  1
18  4  2
19  4  3

#### 52. For this DataFrame df, create a new column of zeros (safe) and ones (mine). The probability of a mine occuring at each location should be 0.4.

In [91]:
# One way is to draw samples from a binomial distribution.

df['mine'] = np.random.binomial(1, 0.4, X*Y)
df

    x  y  mine
0   0  0     0
1   0  1     0
2   0  2     1
3   0  3     0
4   1  0     0
5   1  1     0
6   1  2     0
7   1  3     1
8   2  0     1
9   2  1     1
10  2  2     0
11  2  3     0
12  3  0     0
13  3  1     0
14  3  2     0
15  3  3     1
16  4  0     1
17  4  1     0
18  4  2     1
19  4  3     1

#### 53. Now create a new column for this DataFrame called 'adjacent'. This column should contain the number of mines found on adjacent squares in the grid.

(E.g. for the first row, which is the entry for the coordinate (0, 0), count how many mines are found on the coordinates (0, 1), (1, 0) and (1, 1).)

#### 54. For rows of the DataFrame that contain a mine, set the value in the 'adjacent' column to NaN.

#### 55. Finally, convert the DataFrame to grid of the adjacent mine counts: columns are the x coordinate, rows are the y coordinate.

#### 56. Pandas is highly integrated with the plotting library matplotlib, and makes plotting DataFrames very user-friendly! Plotting in a notebook environment usually makes use of the following boilerplate:
```python
import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')
```
matplotlib is the plotting library which pandas' plotting functionality is built upon, and it is usually aliased to plt.

%matplotlib inline tells the notebook to show plots inline, instead of creating them in a separate window.

plt.style.use('ggplot') is a style theme that most people find agreeable, based upon the styling of R's ggplot package.

For starters, make a scatter plot of this random data, but use black X's instead of the default markers.
```
df = pd.DataFrame({"xs":[1,5,2,8,1], "ys":[4,2,1,9,6]})
```

#### 57. Columns in your DataFrame can also be used to modify colors and sizes. Bill has been keeping track of his performance at work over time, as well as how good he was feeling that day, and whether he had a cup of coffee in the morning. Make a plot which incorporates all four features of this DataFrame.

(Hint: If you're having trouble seeing the plot, try multiplying the Series which you choose to represent size by 10 or more)

The chart doesn't have to be pretty: this isn't a course in data viz!
```
df = pd.DataFrame({"productivity":[5,2,3,1,4,5,6,7,8,3,4,8,9],
                   "hours_in"    :[1,9,6,5,3,9,2,9,1,7,4,2,2],
                   "happiness"   :[2,1,3,2,3,1,2,3,1,2,2,1,3],
                   "caffienated" :[0,0,1,1,0,0,0,0,1,1,0,1,0]})
```

##### 58. What if we want to plot multiple things? Pandas allows you to pass in a matplotlib Axis object for plots, and plots will also return an Axis object.

Make a bar plot of monthly revenue with a line plot of monthly advertising spending (numbers in millions)
```
df = pd.DataFrame({"revenue":[57,68,63,71,72,90,80,62,59,51,47,52],
                   "advertising":[2.1,1.9,2.7,3.0,3.6,3.2,2.7,2.4,1.8,1.6,1.3,1.9],
                   "month":range(12)
                  })
```

## For question 59-60, Use the following code:

In [1]:
import numpy as np
def float_to_time(x):
    return str(int(x)) + ":" + str(int(x%1 * 60)).zfill(2) + ":" + str(int(x*60 % 1 * 60)).zfill(2)

def day_stock_data():
    #NYSE is open from 9:30 to 4:00
    time = 9.5
    price = 100
    results = [(float_to_time(time), price)]
    while time < 16:
        elapsed = np.random.exponential(.001)
        time += elapsed
        if time > 16:
            break
        price_diff = np.random.uniform(.999, 1.001)
        price *= price_diff
        results.append((float_to_time(time), price))
    
    
    df = pd.DataFrame(results, columns = ['time','price'])
    df.time = pd.to_datetime(df.time)
    return df

#Don't read me unless you get stuck!
def plot_candlestick(agg):
    """
    agg is a DataFrame which has a DatetimeIndex and five columns: ["open","high","low","close","color"]
    """
    fig, ax = plt.subplots()
    for time in agg.index:
        ax.plot([time.hour] * 2, agg.loc[time, ["high","low"]].values, color = "black")
        ax.plot([time.hour] * 2, agg.loc[time, ["open","close"]].values, color = agg.loc[time, "color"], linewidth = 10)

    ax.set_xlim((8,16))
    ax.set_ylabel("Price")
    ax.set_xlabel("Hour")
    ax.set_title("OHLC of Stock Value During Trading Day")
    plt.show()

#### 59. Generate a day's worth of random stock data, and aggregate / reformat it so that it has hourly summaries of the opening, highest, lowest, and closing prices

#### 60. Now that you have your properly-formatted data, try to plot it yourself as a candlestick chart. Use the plot_candlestick(df) function above, or matplotlib's

#### 61. Select columns by dtype

#### 62. Convert numbers stored as strings (coerce)

#### 63. Split a dataframe into 2 random subsets

#### 64. Dealing with missing values (NaN)

#### 65. Using glob to generate a dataframe from multiple files

#### 66. Reduce memory usage of a dataframe while importing

#### 67. Check if the equality of 2 series

#### 68. Rename all columns with the same pattern.

#### 69. Merging datasets and check for uniqueness.

#### 70. Avoid the series of lists TRAP.

#### 71. Creating a toy dataframe (3 methods)

#### 72. Reshape a Multindex dataframe (unstack())

#### 73. Select multiple rows/columns with loc.

#### 74. Read and write a compressed file (csv zip).

#### 75. SHow memory usage of a dataframe and every column.

#### 76. Create a datetime columns from multiple columns.

#### 77. Split a string columns into multiple columns.

#### 78.Create Dataframes for testing.

#### 79. Fill missing values in time series data (interpolate())

#### 80. Copy data from Excel into pandas quick (read_clipboard()).

#### 81. 3 ways of renaming columns names

#### 82. Formatting different columns of a dataframe (using dictionaries)

#### 83. Aggregation over time series (resample)

#### 84. Aggregating by multiple columns (using agg)

#### 85. Accesing numpy within pandas (without impoorting numpy as np)

#### 86. Pandas merge -> see where the columns are coming from (indicator = True)

#### 87. See all the columns of a big dataframe.

#### 88. Filter a dataframe with query and avoid intermediate variables.

#### 89. Pandas display options

#### 90. Explore a dataset with profiling

#### 91. Query a column that has spaces in the name (using backticks)

#### 92. Convert from UTC to another timezone.

#### 93. Pandas slicing loc and iloc (6 examples)

#### 94. Pandas datetime (lot's of examples)

#### 95. One hot encoding (get_dummies())

#### 96. Style your dataframe fast with hide_index() and set_caption()

#### 97. Ordered categories (from pandas api types import CategorialDtype)

#### 98. New aggregation function => last()

#### 99. Create one row for each item in a list (explode)

#### 100. Use a local variable within a query in pandas (using @)

#### 101. Create rows for values separated by commas in a cell (assing and explode)

#### 102. Store NaN in an integer type with int64.

#### 103. Using parameters when using pd.read_csv().

#### 104. Sampling with pandas (with replacement and weights).

#### 105. Named aggregation with multiple columns passing tuples.

#### 106. Concatenate 2 column strings.

#### 107. Making plots with pandas.

#### 108. Shuffle rows of a df (df.sample())

#### 109. Calculate the difference between each row and the previous (diff()).

#### 110. Filtering a dataframe with mutliple criteria using reduce.

#### 111. Apply a mappings to the whole dataframe (applymap)

#### 112. Accessing the groups of a groupby object (get_group())

#### 113. Use header and skiprows to get rid of bad data or empty rows while importing.

#### 114. Combine the output of an aggregation with the original dataframe using transform.

#### 115. Creating running totals with cumsum function.

#### 116. Reading JSON from the web into a df.

#### 117. Fixing "SettingWithCopyWarning" when chaning columns using loc.

#### 118. Calculate running count with groups using cumsount() + 1.

#### 119. Fixing "SettingWithCopyWarning" when creating a new columns.

#### 120. Select columns using f-strings.

#### 121. Create a bunch of new columns using a for loop and f-strings df[f'{col_new'}].

#### 122. Create a new columns or overwrite using assing.

#### 123. Webscraping using read_html().

#### 124. Check if 2 series are "similar".

#### 125. Read data from a PDF (tabula py).

#### 126. Convert continous variable to categorial.

#### 127. Remove a column and store it as a separate series.

#### 128. Webscraping using read_html() and match parameter.

####  129. Count the number of words in a pandas series.

#### 130. Named aggregations on mutliple columns - avoids multiindex.

#### 131. Aggregate your datetime with by and filter weekends.

#### 132. Rearrange columns in a dataframe.

#### 133. Split names into first and last name.

#### 134. Moving columns to a specific location.

#### 135. Creating a time series dataset for testing.

####  136. Clean object column with mixed data using regex.

#### 137. Combine the small categories into a single category named "Others" (using frequencies).

#### 138. Save memory by fixing your datatypes.

####  139. Count the missing values.

#### 140. Interactive plots out of the box in pandas.

#### 141. Convert year and day of year into a single datetime column.

####  142. Convert a wide dataframe into a long one.

####  143. How to avoid Unnamed: 0 columns.

#### 144. Loading a sample of a big data file.